{
    "resume1.pdf": "John Doe\n\nBoston | (123) 456-7890 | abcxyzj@gmail.com | linkedin.com/in/johndoe\n\nEDUCATION\n\nM.S. — Electrical Engineering, Syracuse University May 2020\n\nSKILLS\n\nPython | C/C++ | SQL | PyTorch | TensorFlow | Scikit-learn | Pandas | Matplotlib | CUDA | AWS | OpenCV\n\nWORK EXPERIENCE\n\nSenior Machine Learning Software Engineer — Company A, Boston Feb 2022—Present\nProject — Unexploded Ordnance Detection Using Overhead Drone Imagery (Client - DARPA)\n\ne Fine-tuned YOLOv11 for detecting unexploded bombs/missiles in a battlefield with 98% precision\n\ne Built an inference server with REST API to deploy model for real time, scalable inferencing\n\ne Programmed the communication pipeline to transmit Cursor-on-Target messages from the server to a\ntactical situational awareness map-viewer app (ATAK) via TCP for real-time visibility of ordnances\n\nProject — Segmentation of Unsafe (MDEH) Ammunition (Client - US Army)\n\ne Trained HRNet-v2 models to segment hazardous and non-hazardous bullets with 89% pixel accuracy\ne Optimized the model (FP16 precision) deploying it on NVIDIA Jetson Xavier for real-time inference\n\nProject — Drone Defect Detection Using Vibration Analysis (Client - NASA)\n\ne Designed, trained and deployed 1D CNN to detect screw and blade defects on drones using vibrational data\ne Designed the data collection and processing pipeline for collecting vibrational data using accelerometers\non the drone\n\nProject — Multi-Sensor Drone Imagery Processing and Visualization (Client - San Francisco Giants)\n\ne Developed a drone-based system to capture high-resolution imagery using RGB, thermal\nand NIR cameras for Oracle Park (Giants’ stadium) processing 2TB images a month\n\ne Designed an automated, scalable AWS pipeline to upload drone images to S3, trigger EC2 instances\nfor real-time orthomosaic stitching, tiling and storage\n\ne Built a client facing web-portal visualizing stitched orthomaps to monitor turf conditions\n\nMachine Learning Engineer - Computer Vision — Company B, Michigan Feb 2021—Feb 2022\ne Trained, deployed ResNet-Upernet model for floor and wall segmentation - 85% mAP\n\ne Trained and deployed an HRNet-v2 using AWS SageMaker for cabinet segmentation - 90%mAP\n\ne Built depth estimation solutions using DenseDepth network serving 1000s of clients a day\n\ne Led the development of a CycleGAN to extract perspective quadrilaterals from room images\n\nData Science Teaching Assistant - Company C, New York Sep 2020—Jun 2021\n\ne Mentored and trained 60 students in Python, R, SQL, ETL, Tableau, A/B testing\ne Conducted weekly office hours to help students with assignments and technical questions\n\nData Scientist - Company D, India Jun 2017—Aug 2018\n\ne Reduced marketing costs by 15% using customer data segmentation for targeted ads\ne Led a3-member team to develop sales forecasting models for inventory management\n\nMachine Learning Researcher — Company E, India May 2016—Jun 2017\n\nProject — Machine Learning Based Fitness Tracking Wearable Band\n\ne Tested K-means, Regression, SVM models to predict human obesity with 98% accuracy, dataset size:144,000\ne Programmed MQTT channel Python API to transfer caloric data from fitness band to cloud\n\nProject — Object Detection System for Self-Driving Cars\n\n@ Worked with Government of India to train a YOLOv2 to detect common street objects for autonomous cars\ne Created a data ingestion pipeline to route images from a Sony IMX imager to edge devices for analysis\n\nPUBLICATIONS\n\nMachine Learning Based Fitness Tracker Platform Using MEMS Accelerometer - IEEE peer-reviewed paper with 15+ citations",
    "resume10.pdf": "FULL NAME\n\nLOCATION, Bengaluru - 1234512345 - firstname@qmail.com - linkedin.com/in/first-last/\n\nPROFESSIONAL SUMARRY\n\nResults-driven tech leader with 8+ years of experience architecting, developing, and scaling web\napplications across fintech, healthcare, e-commerce, and enterprise domains. Adept at bridging\nbusiness goals with technical solutions, | excel in full-stack development using JavaScript, PHP,\nPython, and cloud platforms like AWS and GCP. Known for driving innovation, mentoring high-\nperforming teams, and delivering robust, user-focused products. Passionate about continuous\nimprovement, automation, and building platforms that empower both users and businesses.\n\nPROFESSIONAL EXPERIENCE\n\nCompany 6, Location 2 Sep 2024 - June 2025\nLead Technical Consultant\ne Architected and led the implementation of scalable, Al-driven web applications using Node js\nand Reactjs, powering a next-generation platform focused on Fair Stakeholder Experience\n(FSx).\ne Designed and optimized backend services and APIs, ensuring robust, high-performance\ndeployments on AWS for superior stakeholder outcomes.\ne Mentored and grew a dynamic development team, elevating code quality through regular\ncode reviews and best-practice adoption, resulting in a 30% reduction in production issues.\ne Translated complex business needs into actionable technical strategies by collaborating\nclosely with product managers and stakeholders, accelerating innovation cycles by 25%.\ne Drove continuous improvement through rapid Proofs of Concept (POCs), keeping the\nproduct on the leading edge of technology and market demands.\ne Enhanced platform scalability, security, and system speed, delivering a seamless balance\nbetween functionality, performance, and user experience.\n\nCompany 5, Location 2 Jul 2021 - Sep 2024\nSoftware Development Engineer 2\ne Developed and maintained customer-facing products using ReactJS and Node js, supporting\n1OOK+ end users.\ne Automated testing and data extraction tasks with Puppeteer, reducing manual QA effort by\n40%,\ne Improved internal tools and workflows, leading to a 25% increase in team productivity.\ne Deployed scalable solutions on AWS and optimized MySQL queries, enhancing application\nperformance and reliability.\ne Elevated code quality standards through SonarQube integration, decreasing critical bugs by\n30% release-over-release.\n\nCompany 4, Location 2 Sep 2019 — Jul 2021\nSystem Analyst\ne Enhanced user experience for Abbott's flagship e-commerce platform in Germany, leading to\na 20% increase in customer satisfaction scores.\ne Leveraged PHP frameworks (Laravel, Magento} and ReactJS to deliver new features,\naccelerating release cycles by 30%.\n@ Integrated Adobe Experience Manager (AEM) for content management, reducing page load\ntimes and improving SEO performance.\ne Collaborated with cross-functional teams to implement UX improvements, contributing toa\n15% increase in repeat user visits.",
    "resume11.pdf": "EDUCATION\n\nB.Tech in Computer Science (Honors)\n¢ Minors: Entrepreneurship — Specialization: Artificial Intelligence and Machine Learning\n¢ Current CGPA: 9.67/10\n\nEXPERIENCE\n\nHybrid\nJun 2025 — Current\n¢ Designed and co-developed the entire backend architecture of a Flask—React lead management system,\nincluding RBAC-based role handling and SHA256+OTP authentication for 3 user types (Admin, Vendor,\nAgent).\ne Engineered modular REST APIs for authentication, leads tracking, form creation, agent assigning, vendor\nanalytics, and lead routing; reduced manual assignment effort by 40%.\n¢ Outlined and implemented the full Database architecture using SQLAlchemy ORM; deployed on VPS with\nMySQL, SMTP, and production-grade rate-limiting and request validation.\n\nSkills: System Design, Flask, MySQL, SQLAlchemy, SMTP, OTP, RBAC, REST APIs, Real-Time Systems, VPS\nDeployment\n\nRemote\nOct 2024 — Apr 2025\n\n¢ Designed and trained 30+ deep learning model variants to classify oral and ear scan videos for a public health\nscreening of 1M-+ children.\n\n« Used MobileNetV2, ResNet, and LSTM architectures, achieving 85%-+ accuracy through data\naugmentation and cross-validation.\n\ne Extended work was on model efficiency using minLSTM/minGRU and improved clarity through targeted\nRoboflow annotations.\n\nSkills: Deep Neural Networks, TensorFlow, Keras, OpenCV, Roboflow, Cross- Validation, Data Augmentation\n\nRemote\nMar 2024 — Sep 2024\n¢ Collaborated on a Java-based CNN implementation, initially inspired by LeNet-5, under strict no-library\nconstraints.\n¢ Contributed to building 100+ NumPy-style functions covering tensor ops, shape logic, and end-to-end testing\nwith JTest.\ne Implemented complex ML concepts including backpropagation, axis manipulation, and broadcasting from\nscratch.\nSkills: Neural Networks, Java, Custom Algorithms, Machine Learning, Lambda Expressions\n\nPROJECTS\n\nJun 2023 — Jul 2023\n¢ Created a GUI tool to cross-check 3,500+ invoices using HSN Codes.\nIntegrated Apache POI to export data into Excel, enabling easy access to records.\n¢ Packaged the application using Launch4J for deployment.\n\nFeb 2022 — Jan 2023\n\n¢ Programmed C on Arduino to perform metal detection and waste sensing with 80% accuracy.\ne Enhanced control precision, achieving real-time feedback and response times under 3.5 seconds.\n\nTECHNICAL SKILLS\n\nLanguages: Java, Python, C, HTML, CSS, SQL\nTools: GitHub, Jupyter NoteBook, IntelliJ, VS Code, Eclipse, PyCharm, Postman, pgAdmin\nCloud + Hosting: PythonAnywhere, Vercel, GCP, AWS, Render, Leapcell",
    "resume12.pdf": "Skills\nLanguages: C/C++, Python, JavaScript, TypeScript, CSS\n\nTechnologies & Tools: NextJS, ReactJS, ExpressJS, NodeJS, TailwindCSS, ReactThreeFiber, Figma, GSAP, Git, GitHub,\nDocker, Vercel\nCourseworks: System Design, Computer Communication network, Data structure and algorithm, Al/ML\n\nEducation\n\nNational Institute of Technology Mizoram | 2022 - 2026\nBachelors in Electronics and communication Engineering\n\nExperience\n\nFIVERR | Freelance Front-end Developer Aug 2024 - April 2025\n* Completed 5+ projects including 2D animations and 3D configurators, increasing client engagement and satisfaction\nby 35%.\n* Improved page load times by 25% by using R3F, GSAP, and Next.js to build responsive experiences.\n* Maintained 100% client satisfaction by collaborating with 5+ international clients through clear communication and\ntimely delivery.\nMUSICBLOCKS | Open source contribution Jan 2024 - Feb 2024\n* Improved reliability for 5,000+ users by fixing a bug that caused warning boxes to disappear on stop.\n* Eliminated related bug reports by 40% by analyzing code thoroughly and deploying a fix per project guidelines.\n* Boosted app stability and user retention by resolving GitHub issue 3248 through targeted debugging and testing.\n\nBHARAT INTERN | Web Developer Intern Nov 2023 - Dec 2023\n* Coded a responsive front-end user registration page using HTML5, CSS3, and JavaScript to ensure compatibility for\nmultiple devices.\n\n* Integrated Restful APIs with Node.js and Express.js, improving authentication efficiency and reducing login errors\nby 30%.\n\n* Incorporated Git and GitHub for CI/CD pipeline and Version Control, improving deployment efficiency by 40% and\nstreamlining team collaboration.\n\nProjects\n\nDINING TABLE CONFIGURATOR GitHub | Live\n* Using R3F, React.Js and Next.Js, a real-time 3D dining table configurator was built, cutting down on load time by\n25%.\n\n* Implemented efficient client-side state management to enable real-time updates and smooth user interactions in the\nconfigurator.\n\n* Used CSR and SSR to improve configurator performance, increasing user completion rate by 30% and load speed by\n45%.\n\n1965 FORD MUSTANG SHOWCASE WEBSITE GitHub | Live\n* Designed and developed an interactive show site for the 1965 Ford Mustang to raise visitor involvement by 45%.\n\n* Created realistic 3D visuals using React Three Fiber, lowering the overall bounce rate by over 33%.\n\n* Initiated GSAP animations and seamless transitions to improve performance by 40% overall, so improving per-\nceived performance and user retention.\n\nGRAPH ALGORITHM VISUALIZER -_ GitHub | Live\n* Implemented a Graph Algorithm Visualizer to visualize Depth First Search and Breadth First Search algorithms.\n* Enabled users to build custom graphs and view animated paths in real-time.\n* Assisted leamers grasp graph theory 50% faster, impacting over 1,000 students through interactive visualization.\n\nAchievements\n\n* Ranked in the top 4% out of 905,590 students nationwide competitive exam JEE Main.\n* In college-wide coding event secured 3rd place among all students.",
    "resume13.pdf": "SUMMARY\n\nI am a skilled Software Engineer specializing in React JS, JavaScript, and TypeScript, with expertise in building scalable web and\nmobile applications using Flutter, React Native, Kotlin, and Swift. A ServiceNow Certified Application Developer and AWS Certified\nCloud Practitioner, I excel in UI/UX design, data integration, and predictive modeling with Python, SQL Server, MongoDB, and\nMySQL. With experience in Agile methodologies, | develop MVPs that meet complex business needs while leveraging Tableau and\nPower BI for data visualization. Holding a Master's in IT and IT Management, | focus on delivering high-quality, user-centric\nsolutions.\n\nEDUCATION\nUniversity of Sydney | MASTER OF INFORMATION TECHNOLOGY AND MASTER OF INFORMATION\nTECHNOLOGY MANAGEMENT (DATA MANAGEMENT AND ANALYTICS) 2023-2024\nModules: Data Visualizations, Machine Learning, Data Mining, Statistical Data Analysis, Predictive Modelling\nCVR College of Engineering | BACHELOR OF TECHNOLOGY (INFORMATION TECHNOLOGY) 2016-2020\n\nModules: Mobile Application Development, Operating Systems, Linux Programming, Cloud Computing.\nTECHNICAL SKILLS\n\nFrontend: React, JavaScript, TypeScript, Redux, Axios, Redux, React Router, HTML, Tailwind, Bootstrap, Jest\nBackend: Node.js, Express.js, TypeScript, GraphQL\n\nDatabase: MySQL, SQL Server, MongoDB, PL/SQL\n\nMobile Applications: Kotlin, Java, Swift.\n\nCross-platform: Flutter, React-Native.\n\nTools: Git, CI/CD (GitHub Actions, Jenkins), Figma, Tableau, Power BI, Postman, Jest, NPM, Jira, Slack.\nTesting: Playwright, Junit.\n\nSDLC Methodologies: Agile, Scrum, Spiral, Waterfall Methodology.\n\nEXPERIENCE\n\nValueLabs LLP | Software Engineer — Hyderabad 07/2020 to 06/2022\nContributed to Web Application and Mobile Application teams at ValueLabs LLP as a Front-End Developer, developing applications\nusing Agile methodologies and Scrum framework.\nProject: Super Red\n\ne Built a web application integrated with a music player in React JS, with a responsive design, ensuring cross-browser\ncompatibility.\nIncludes handling audio blobs received through a WebSocket, storing them in a queue, and playing them back seamlessly.\nOptimized audio streaming by adaptive bitrate streaming techniques like DASH and HLS reducing buffering time by 50%\nDeveloped a Settings page for choosing adaptive audio streaming-related options based on network connectivity.\nImplemented Redux for state management and Axios for integrating APIs and making XMLHttpRequests from the browser.\n\nProject: MyKAD eK YC\nMyKAD eKYC is an e-K YC application for Astro, a Malaysian-based IPTV Provider, Satellite Television, and Radio Operator using\nMalaysian MyKAD identity card as the identity proof.\ne Built a cross-platform application using Flutter for usage across Android and iOS platforms, reducing the onboarding process\nby 60%.\ne Integrated the eKYC third-party SDK shared by the client in Flutter using the Service Channel and Method Channel\ncommunication pathways.\ne Enhanced security in Flutter using OWASP guidelines like HTTP with certificate pinning and encrypted local storage.",
    "resume2.pdf": "I EEC\n\nSUMMARY\nAs a Computer Science and Engineering student I bring strong diligenec, the ability to work both independently, and\nwithin a team and the capacity to communicate technical information te non-technical professionals and present complex\ninformation effectively. My personal projects have honed my skills in teamwork, communication, problem-solving and\ndemonstration. | am excited to apply these strengths in a dynamic and innovative environment during the intemship.\n\nEDUCATION\n\nExpected Graduation: May, 2026\n@ Bachelor’s in Computer Science and Engineering (Penultimate Year)\ne Relevant Courses: Software Engincering, Data Structure, Algorithm, Probability and Statistics, Linear Algebra,\nCalculus, Computer Graphics, Object Oriented Programming\n\nTECHNICAL SKILLS\n\n¢ Computer Languages: Python, SQL, C++, and Java.\n\ne Tools: TensorFlow, Scikit-leam, NumPy, SciPy. Pandas, Seabom, Apache Spark, Matplotlib, PyTorch, OpenCV,\nGymnasium, Keras-RL2, Git, GitHub, and Power BI.\n\ne Data Science Skills: Data Science Pipeline (Collection, Cleaning. Analysis, Mining. Warehousing. Modeling,\nVisualization), Machine Learning, Deep Learming, Reinforcement Leaming, Prompt Engineering.\n\n© Qperating Systems: Windows, and Debian-based Linux distnbutions.\n\ne Cloud and Virtualization: Google Cloud, AWS, Docker.\n\nPROJECTS EXPERIENCE\n\nIndependent Technical Project Name, \\food! ision\n¢ Developed a system to analyze facial expressions, age and gender using CNN Classifier with ResNet layer.\nUulized multi-task learning to sumultancously predict multiple outputs.\nAchieved 54% accuracy in emotion detection, $5% in gender classification, and 65% in age estimation.\nPlotted Histograms and Pie Charts to get a deeper understanding of the datasct.\nVisualized the classification performance using confusion matnx as well as measured the precision score, recall\nscore and Fl! score which helped with increasing facial recognition accuracy around 7%.\nee Technical Project Name, Sign2Text\nCreated a system to translate American Sign Language into text using CNN Classifier with a classification\naccuracy of 94%,\nCreated bar charts to visualize the dataset and display the number of samples for cach label.\nMeasured precision score, recall score and F! score to get a better measurement of the performance of the model\nand eventually improved the accuracy of the model by 3%.\n\nIndependent Technical Project Name, Succoff\n¢ Developed a deep Iearning neural nctwork that can identify six different mosquito species.\ne Uulized CNN Classificr with ResNet layer to achieve an accuracy of about 81%.\n\ne Visualized onc image from cach label, as well as bar charts and pic charts to have a deeper understanding of the\ndatasct.\n\ne Plotted confusion matrix and recal]-precision curve, and calculated precision, recall and F1 scores to visualize the\nperformance of the modcl and helping in increasing the accuracy of the model by 12%.\n\nIndependent Technical Project Name, EcoForecasler\n\n@ Predicted air quality indices (MSE: 0.12) using Random Forest, analyzed scasonsl trends with tme-scrics\nmethods, and visualized pollutant Icevcls through hcatmeps and trend graphs.",
    "resume3.pdf": "SUMMARY EXPERIENCE\n\nTechnical Lead & ML Engineer 1/2025 - Present\ngning and cepioyine\n\nvironmer pecializec .\n\n; ur 2 T\n\naqge mode\n\nJtputs, enhancing patien\n\nnd multimocr 1 orchestratior\nain, MCP and . ed an infere for patient\novisual generatic ts\n. zed model la m 91s to 5£\neal -tin\n* I-ba 1d GCP Fi e,\nlity 1 edge ces\next }\nActively « Condt comprehensive evaluations on time-to-generation and response\n\nons in multi- acc\n\n« Directed agile\n\nGenaAl f ntelligent au atio prioritizing at\n\nSKILLS\nirchestration\n\nWorkflows\n\nn for training\n\n-time evidence retrieva\n\nerparameter tuning and boosting accuracy b ver 10%\n\nae atir f Y\n« Led full syst fevelopment from inception to deployment, includir lata desiqt\nnodeil selection, and infrastructure setup for an LLM-dnven toxicity detection or\n\nRetrieval-Augmented Gene\n\nEthical Al (GDPR - Al Act)\nNumPy andas > -learm - AWS\n\nDocker\n\nmaqge-base\n\nCERTIFICATIONS\n\ndetection fran\n\ni tempora\n\nimage itching and 7096\n\nAzure Al Engineer Associate\n\nentation leaming\nsing PyTorch, Huge\nust experiment tracking\n\nmentais . itegrated, production-ready tool, illustrating infrastructure",
    "resume4.pdf": "_—_s £24285 ~~ sa 2 Se * OS\n\nak\n+91 ES | smeteOGeemeeyt in | LinkedIn | Github | Portfolio\nEDUCATION\n\nB.Tech in Computer il Engineering (8.33/10.0) Aug’23 - July’27\n\nMinor in International Relations, Specialisation in Data Science\n\nEXPERIENCE\nLLM Intern, Critical AI Pvt Ltd, Bengaluru July’25 - Current\n\ne GenAI Audio & Image based narrative creation using Meta’s Llama-3.2-8B\n\n- Integrated a multimodal GenAI system with RAG, Whisper STT, gTTs, image search, and OSM mappings.\n- Business Impact: Improved functionality by over 50% of base provided console.\n\n- Software tools: llama-cpp-python, faiss, Py Mongo\n\nAI Intern, WESEE, Ministry of Defence, New Delhi May’25 - July’25\n\ne Data Analysis and Report Generation Agent with MCP architecture\n\n- Built a robust chatbot pipeline for processing real-time SQLite data, and generating reports for real-time usage.\n- Business Impact: Reduced the workload of critical subject matter experts by more than 90%.\n\n- Software tools: Langchain, SQLAlchemy, LangGraph, mcp-use, Ollama\n\ne YOLOv8 Object Detection and Tracking with automated selenium web-scraped datasets\n\n- Delivered object detection and tracking system, tuned on custom webscraped dataset, receiving over 75% accuracy.\n- Business Impact: Improved reliability of real-time usage by more than 50%.\n\n- Software tools: Ultralytics, Selenium\n\nPROJECTS\n\nXLM-RoBERTa based Multi-Lingual sentiment analysis with auditory input support ©\ne Developed pipeline that applies multi-modal analysis of audio input, with 5 supported languages scoring 70% accuracy.\ne Utilises whisper for audio-to-text transcription, XLM-RoBERTa for textual sentiment analysis, AudioCNNs for auditory\nsentiment analysis of MFCCs and an MLP model for data fusion.\ne Technology Stack: PyTorch, scikit-learn, Fast API, transformers\n\nGPT-2 Style LLM creation and Meta LLaMA-3.2 8B LoRA fine-tuning for Data Science workloads ©\ne Built GPT-2 Architecture, replicating key components like MHA, and implementing K V-Cache for for 5x performance.\ne Fine-tuned Meta LLaMA-3 8B employing PEFT training using LORA, and quantized it to Q5K-M as a GGUF.\ne Technology Stack: PyTorch, TikToken, Unsloth, Transformers, PEFT, HuggingFace\nXGBoost based Churn Prediction with SHAP Analysis and powerBI dashboard\ne Designed feature engineering, training and deployment pipeline for telecom churn: to understand why, and take action to\nreduce it, with powerBI dashboard and streamlit frontend for intractability, and SHAP analysis with 70%+ scores.\ne Includes data preprocessing, XGBoost training, Optuna hyperparameter tuning, and multiscored evaluation.\ne Technology Stack: scikit-learn, shap, xgboost, optuna\nHybrid Anime Recommendation System with CI/CD pipeline and Kubernetes deployment ©\ne Deployed pipeline to process data, train NCF model, and deploy on GKE, with over 73% reliability for recommendations.\ne Used Jenkins for orchestrating CI/CD pipeline, tracked experiments with comet-ml, flask for API creation, and Google\nCloud Registry for handling docker images, and DVC for data versioning.\ne Technology Stack: comet-ml, flask, tensorflow, dve\n\nTECHNICAL SKILLS AND CERTIFICATIONS\n\nLanguages Python, C, C++, SQL\n\nLibraries and Frameworks Pandas, Numpy, PyTorch, scikit-learn, mlFlow, llama-cpp-python, Jenkins, kubernetes\n\nCertifications MLOps with GCP - CI/CD & Kubernetes — KrishAI Technologies, 2025\nACHIEVEMENTS\n\n- Dean’s list: Monsoon’23\n- Semifinalist speaker at SMVIT Parliamentary Debate’24 (Debating Societ aH)",
    "resume5.pdf": "EMAIL | PHONE | github.com/NAME\n\nPROFESSIONAL SUMMARY\n\nU.S. Marine Corps veteran and aspiring software engineer with an active Top-Secret SCI Security Clearance, leveraging over\n7 years of experience leading diverse teams in dynamic, fast-paced, high-pressure environments. Possesses a comprehensive\nbackground in workplace safety, risk management, and written and oral communication. Experienced in equipment operation,\ncross-functional collaboration, and technical reporting while managing over $650,000 in assets with zero losses or damage.\n\nTECHNICAL COMPETENCIES\n\nLanguages: C++, Java, JavaScript, Python Development Tools: Git, GitHub, Command Line Tools\nDatabases: MySQL Operating Systems: macOS, Windows, Linux, Raspbian\nPERSONAL PROJECTS\n\nAI Search Algorithms — Pacman | Python\ne Built search-based AI agents using A*, BFS, DFS, and UCS in a game-like environment with custom heuristics to\nsolve complex navigation tasks. Extended codebase to support multiple intelligent agents and dynamic goal planning.\n\nRPG Decision Tree Game | C++\ne Built a text-based RPG by implementing binary tree structures to manage branching narratives, dynamically allocating\nmemory and traversal logic to support interactive storylines.\n\nMountain Lion Detection System | Python, Systems Design\ne Simulated a wildlife auditory detection system by designing an alert network with automated triggers and 30-day data\nretention to model real-time environmental monitoring.\n\nSmart Mirror Display (MagicMirror Platform) | JavaScript, CSS\ne Assembled and programmed a personalized smart mirror using the MagicMirror platform. Integrated hardware,\ndisplay modules, and custom software to deliver real-time information such as weather, calendar events, and news.\n\nKEY CONTRIBUTIONS\n\ne Strategic Planning, Scheduling: An experienced strategic planner skilled at balancing multiple competing priorities.\nDemonstrated ability to deliver critical results under high-stress conditions.\n\ne Program Management, Collaboration: Expertise in delegating, building consensus, establishing measurable\nobjectives for goals/projects, and creating and enforcing timelines.\n\nPROFESSIONAL EXPERIENCE\nUnited States Marine Corps Various Locations — Overseas, Stateside\n\ne Department Manager March 2021 - December 2023\no Managed daily operations for maintenance center with over 48 personnel and over $650,000 in equipment.\no Processed 2,400 work orders and coordinated safe handling of hazardous materials and unserviceable assets.\no Led collaborative teams to reduce risk incidents through proactive safety planning.\n\ne Agency Operations Supervisor / Trainer July 2016 - March 2021\no Managed and trained over 545 military personnel across over 60 live-fire ranges and over 85 field exercises.\no Delivered over 100 training sessions in combat engineering and logistics, increasing team capabilities by 35%.\no Served as a field translator on overseas humanitarian missions and the construction of civic infrastructure.\n\nSKILLS\n\ne Analytical Thinking e <Adaptability e Collaboration\n\ne Problem-Solving e Communication e Time Management\nett\nUNIVERSITY CITY, California\nAssociate of Science for Transfer, Computer Science (GPA: 4.0/ 4.0) May 2024\nUNIVERSITY CITY, California\nBachelor of Science, Computer Science (current GPA: 4.0/4.0) Expected May 2026\n\nRelevant Coursework: Data Structures, Operating Systems, Algorithms, Software Design, Al, Assembly Language",
    "resume6.pdf": "Joe Schmo\n+***#**** @amail.com | github.com/*****\n\nTechnical Skills\n\nProgramming: Python, C++, Java, R, SQL\n\nMachine Learning: PyTorch, TensorFlow, Reinforcement Learning, Reliable ML, Responsible Al, NLP, GPT\nPrompt Engineering, Multimodal Data Processing, Agentic Al\n\nData Analysis: NumPy, Pandas, Matplotlib\n\nTools: Jupyter Notebook, Colab, Git, MLflow (MLOps), Docker, Cirq\n\nProfessional Summary\n\nGraduate student in Applied Artificial Intelligence with a strong foundation in machine learning,\nreinforcement learning, NLP, embedded systems, loT applications, quantum computing and agentic Al.\nExperienced with reliable and responsible Al techniques, multimodal data, MLOps, and GPT prompt\nengineering. Seeking a Machine Learning Engineer Intern position to apply technical expertise and\ncontribute to innovative Al solutions.\n\nEducation\n\nUniversity of ******* — M.S. in Applied Artificial Intelligence (2024 — 2026)\n\nUniversity of ******* — B.S. in Cognitive Science, specialization in Machine Learning and Neural\nComputation; Minor in Mathematics(2022 — 2024)\n\nFHEEKEEEK® — A'S. in Computer Science and Applied Mathematics (2018 — 2021)\n\nProjects\n\nKilauea Earthquake Time-Series Prediction (2024)\n\n* Developed a CNN model to forecast seismic activity at Kilauea using time-series data.\n¢ Implemented multimodal data integration to enhance prediction accuracy.\n\nResponsible Al Framework for Loan Predictions (2024)\n¢ Designed a reinforcement learning pipeline integrated with fairness constraints for responsible Al.\n¢ Implemented MLOps practices for model versioning, reproducibility, and deployment.\n\nGPT Prompt Engineering for NLP Applications (2024)\n\n¢ Created optimized GPT prompts for multimodal datasets to enhance model reasoning and output\nreliability.\n\n¢ Focused on safe and interpretable interactions in conversational Al systems.\n\nExperience\n\nReal Estate Agent — ******** (2018 — 2023)\n\nAudio Engineer — ********** (2014 — 2023)\n\nBranch Manager, Assistant VP — Big Bank (2010 — 2014)",
    "resume7.pdf": "Johnny Test\n\nSchoolEmail.edu | LinkedIn: Johnny Test | Github: JohnnyT| Middle of Nowhere, VT | 123-456-7890\n\nEDUCATION\nUniversity of Goofy Goobers, Middle-of-Nowhere, VI\n\nBachelor of Science in Information Systems Expected May 2027\n\nHonors: Dean’s List, President’s List, Merit Scholarship\n\nSKILLS\n\nProgramming Languages: Java, Python, SQL, R, JavaScript, HTML/CSS\n\nDevelopment Tools: Git, VS Code, IntelliJ, Microsoft Excel, Google Sheets, Tableau\n\nOperating Systems: Windows, MacOS\n\nCertifications: Google Data Analytics\n\nSoft Skills: Project management, leadership, attention to detail, time management, team collaboration\n\nPROJECTS\n\nText-Based Adventure Game - Lead Developer, Semester Project, Java February 2025\n\ne Designed and developed a choice-driven game based on Planet of the Apes, implementing randomized events and branching\nstorylines\n\ne Coordinated version control with GitHub and collaborated with peers to ensure modular code structure\n\nEmail Administration System - Solo, Java January 2025\ne Built an email client with features for account creation, inbox management, and password security\n\ne Applied string manipulation and regular expressions to validate email formatting\nAttendance Management System - Lead Developer, Semester Project, Java April 2024\n@ Developed a school-focused tool to track student attendance and grades\ne Utilized Git for collaboration and managed merge conflicts during development cycles\nPhoneBell - Solo, Final Project, CSV and Python December 2023\ne Created a simulated phone network handling contacts, messaging, and call logs with read, append, and write capabilities\nutilizing CSV\ne Designed a menu driven command line interface for seamless interaction and usability\nEXTRACURRICULARS\nCybersecurity Club\n@ Member | Engaged in cybersecurity challenges, CTFs, and team-based network security discussions\nEthnic Engineering Club\n@ Member | Participated in workshops, networking events, and engineering hackathons.\nCooking Club\ne President | Led organization efforts, event planning, and community engagement on establishing fundamental culinary\nSkills, nutrition, and safety practices.\nEXPERIENCE\nTWoods Entertainment Venue | food Runner, MiddleofNowhere, VT May 2024 — August 2024\n¢ Served guests by receiving food from kitchen and delivering it to the correct bays efficiently\n¢ Assisted bay hosts and caddies and handled complaints and issues by customers with service\nGrocery Store | Cashier, MiddleofNowhere, VT April 2023 — August 2023\n¢ Handled point-of-sale systems and managed cash transactions efficiently.\n¢ Developed strong customer service and problem-solving skills.\nSoccer Park | Maintenance Personnel, MiddleofNowhere, VT March 2022 — Jan 2023\n¢ Maintained facility cleanliness by collecting trash and ensuring a safe environment for guests\n¢ Assisted in field upkeep, equipment setup, and maintenance, ensuring smooth operations for events.\nACADEMIC COURSEWORK\nIntroduction to Java Hardware and Software Concepts Intro to Data Analytics\n\nComputer Science I Management Information Systems Macroeconomics\nObject Oriented Programming II Calculus I Accounting I & II",
    "resume8.pdf": "JOHN SMITH\n\nDIRECTOR, DATA SCIENCE & Al STRATEGY\n\nCONTACT\n\n+1-123-555-1234\n\n[DX] johnsmith@hotmail.com\n\n& www.linkedin.com/in/johnsmith\n\nLocation, CA\n\nSKILLS\n\ne Strategic, Cross-Functional Leadership\n\nand Collaboration\n\ne Mentoring, Coaching and Development\n\ne Systems Thinking\n« Business Transformation\n\ne Data Engineering, Data Science, Al\n\ne Analytics and Insights\ne Technology Strategy\n« Project Management\n\ne Data Strategy and Governance\n\ne Demand Generation\ne Systems Integration\n\n« Customer-First and Stakeholder\n\nEngagement\ne Establish KPls and OKRs\n\neee eee eee eee e eee ew en eseeseeseeseses\n\nEXPERTISE\n\ne Python\n\ne SQL, dbt\n\ne Spark / PySpark, Hadoop\ne Databricks\n\n¢ Snowflake, BigQuery\n\ne Airflow, Oozie Fivetran\ne copy.ai, Copilot, ChatGPT\ne AWS, Azure\n\ne Git, CI/CD\n\ne Tableau, CRM Analytics\ne Jira\n\ne SCRUM / Agile, Waterfall\ne¢ Tableau, PowerBl, Excel\n\n« SmartSheet, Google Workspace\n\ne Microsoft Office\n\nSUMMARY\n\nEmpowering outcome-based decision making through the delivery and analysis of rich\nand meaningful data. Architecting tools and systems to connect people and process,\nuniting and leading teams to deliver impactful insights that shape business strategy.\n\nPROFESSIONAL EXPERIENCE\nDirector, Data Science & Al Strategy\n\nBig Networking Company Name 2017 - Present\n\ne Grew and led a global team of 15 Data Engineers, Data Scientists and Analysts,\ntransforming culture from being intuition led to data driven.\n\ne Architected and implemented scalable, Al-ready data platforms using Databricks and\nSnowflake, supported by complex ELT pipelines built with Airflow, Spark, Python, and\nSQL to ensure data quality, observability, and performance.\n\ne Lead cross-functional agile teams to implemented best-practice guidelines for data\ngovernance and stewardship, maintaining a pragmatic approach to data access to\nenable insights and decision making across the organization.\n\n« Managed multiple data warehouse migrations overseeing the design and\ndevelopment of scalable data pipelines, supporting Analytics and Insights teams, and\nensuring data quality with best-practice MDM approaches.\n\n« Architected a Customer 360 data model, creating a digital-twin of Marketing, Sales\nand Services to support Revenue Operations. Allowing for troubleshooting and\ndiagnostics of campaign performance and RO! metrics, as well as enabling Sales\nteam to increase likelihood of quota attainment by up to 20% through use of\nsupporting Dashboards.\n\n« Communicated complex data insights to both technical and non-technical audiences\nacross the business, including Go-To-Market leadership, VPs, and C-level\nstakeholders, by delivering presentations and dashboards that translate data into\nactionable, decision-ready insights.\n\ne Spearheaded implementation and deployment of Al/LLM strategy within Go-To-\nMarket, delivering hyper-personalized content, demonstrating an increased email\nengagement and response rate from 1% to 10%.\n\n« Delivered Demand Generation data set and Dashboards, providing campaign level\nperformance reporting, enabling campaign strategists and architects across paid\nmedia and demand to more effectively position GTM strategy.\n\ne Propensity based Lead Scoring: Led cross functional delivery of an Al/ML based lead\nscoring model, decreasing qualified lead volume by ~40%, while doubling BDR\nopportunity conversion rate.\n\ne Led Scope 3 ‘Use of Sold Product’ carbon emissions (CO,e) data and documentation\nefforts, delivering key metrics to support Company's Corporate Social Responsibility\n(CSR) reporting and sustainability initiatives.\n\ne Provided mentorship to both direct and cross-functional team members, fostering a\nservice-oriented, business-first mindset focused on continuous learning and\ndelivering measurable impact.",
    "resume9.pdf": "WORK EXPERIENCE\n\n|S April 2018 — Present\n\nProduct Engineer Rosario, Argentina\n\n« Led development and on-site production implementation of 50+ new products annually for domestic and\ninternational aftermarket, contributing approximately $20,000 in extra profit per year.\n\n« Managed development and PPAP approval for 150+ internationally outsourced products for the South\nAmerican aftermarket, driving approximately $25,000 in extra profit annually.\n\n« Analyzed market opportunities in the aftermarket sector by assessing the current product portfolio and\nmotor vehicle circulation trends.\n\n« Proposed and implemented product changes, resulting in annual cost savings of $15,000 and an increase in\nproduction output by 5%.\n\n* Participated actively in Failure Mode and Effect Analysis (FMEA) meetings to mitigate manufacturing\nissues and minimize associated risks.\n\n« Coordinate a team of 3 CAD designers, overseeing their daily activities to ensure OEM and aftermarket\nproject milestones and objectives alignment\n\n« Prepare product documentation and specifications for catalog distribution\n\n=z, April 2017 — March 2018\n\nDesigner Rosario, Argentina\n\n« Created technical drawings using CATIA and AutoCAD, and managed bills of materials and technical\nspecifications within SAP for OEM and aftermarket products.\n\n« Proposed design improvements, achieving cost reductions and enhancing productivity for both OEM and\naftermarket projects.\n\nFe June 2016 — March 2017\n\nMaintenance Internship Perez, Argentina\n\n* Drafted technical drawings for machine spare parts and tooling in AutoCAD.\n\n« Conducted comprehensive analysis of preventive maintenance schedules and proposed new ones to optimize\nproduction efficiency and reliability.\n\n« Generated documents for standardized tasks and procedures.\n\nEDUCATION\n\nUniversidad Austral Rosario August 2023 — Present\nMaster s Degree in Data Science (in progress) Rosario, Argentina\n\nUniversidad Nacional de Rosario December 2017\nBachelor of Science in Mechanical Engineering Rosario, Argentina\n\nSKILLS\n\nMicrosoft Suite\nSAP\n\nCatia\n\nLean Manufacturing\n\nProject\nAPQP\nFMEA\nPython"
}